# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\Empresa\Christian\Versiones\Github\FCS\Integrador\Wireless\Psoc_Wireless.cydsn\Psoc_Wireless.cyprj
# Date: Mon, 08 Oct 2018 15:53:12 GMT
#set_units -time ns
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 15.151515151515152 -waveform {0 7.57575757575758} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 15.151515151515152 -waveform {0 7.57575757575758} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {SPIM_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 17 35} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {PSOC_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 37 73} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {LCD2_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 73 145} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {LCD1_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 73 145} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {XBee_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 73 145} [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {WIFI_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 143 287} [list [get_pins {ClockBlock/dclk_glb_5}]]
create_generated_clock -name {GSM_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 143 287} [list [get_pins {ClockBlock/dclk_glb_6}]]
create_generated_clock -name {timer_clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 65537 131073} [list [get_pins {ClockBlock/dclk_glb_7}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for D:\Empresa\Christian\Versiones\Github\FCS\Integrador\Wireless\Psoc_Wireless.cydsn\TopDesign\TopDesign.cysch
# Project: D:\Empresa\Christian\Versiones\Github\FCS\Integrador\Wireless\Psoc_Wireless.cydsn\Psoc_Wireless.cyprj
# Date: Mon, 08 Oct 2018 15:52:49 GMT
